pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_cmtw_rx.c
* Description  : This module creates a timer tick using a CMTW channel based on an input by the user.
*              : The module also supports output compare and input capture features to generate
*              : waveforms and detect external events.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 29.08.2014 1.00    First GSCE Release.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <stdio.h>

#include "platform.h"
/* Configuration for this module. */
#include "r_cmtw_rx_config.h"
/* Header file for this module. */
#include "r_cmtw_rx_if.h"
/* Internal definitions */
#include "r_cmtw_rx_private.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define CMTW_COUNTF_MIN             (0x00000001)
#define CMTW_COUNTF_MAX             (0xFFFFFFFF)

#define CMTW_ACTION_ISR_ENABLE_MASK     (CMTW_ACTION_INTERRUPT | CMTW_ACTION_CALLBACK | CMTW_ACTION_ONESHOT)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if CMTW_CFG_USE_CH0 == 1
/* Channel ROM info */
const cmtw_prv_ch_rom_info_t g_cmtw_rom_ch0 =
{
    &(CMTW0),                           /* Pointer to the registers */
    CMTW_CHANNEL_0,                     /* Channel */
    BIT1_MASK,                          /* MSTP mask bit */
    CWTW_CFG_IPR_CM_CH0,                /* Compare match interrupt priority level */
    CMTW_CFG_IPR_OC0_CH0,               /* Output Compare 0 interrupt priority level */
    CMTW_CFG_IPR_OC1_CH0,               /* Output Compare 1 interrupt priority level */
    CMTW_CFG_IPR_IC0_CH0,               /* Input capture 0 interrupt priority level */
    CMTW_CFG_IPR_1C1_CH0,               /* Input capture 1 interrupt priority level */
    &ICU.IR[IR_CMTW0_CMWI0].BYTE,       /* Pointer to compare match ICU IR register */
    &ICU.IPR[IPR_CMTW0_CMWI0].BYTE,     /* Pointer to compare match ICU IPR register */
    &ICU.IER[IER_CMTW0_CMWI0].BYTE,     /* Pointer to compare match ICU IER register */
    IEN_CMTW0_CMWI0,                    /* Compare match IEN mask bit */
    &ICU.IR[IR_CMTW0_OC0I0].BYTE,       /* Pointer to output compare 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_OC0I0].BYTE,     /* Pointer to output compare 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_OC0I0].BYTE,     /* Pointer to output compare 0 ICU IER register */
    IEN_CMTW0_OC0I0,                    /* Output compare 0 IEN mask bit */
    &ICU.IR[IR_CMTW0_OC1I0].BYTE,       /* Pointer to output compare 1 ICU IR register */
    &ICU.IPR[IPR_CMTW0_OC1I0].BYTE,     /* Pointer to output compare 1 ICU IPR register */
    &ICU.IER[IER_CMTW0_OC1I0].BYTE,     /* Pointer to output compare 1 ICU IER register */
    IEN_CMTW0_OC1I0,                    /* Output compare 1 IEN mask bit */
    &ICU.IR[IR_CMTW0_IC0I0].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_IC0I0].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_IC0I0].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW0_IC0I0,                    /* Input capture 0 IEN mask bit */
    &ICU.IR[IR_CMTW0_IC1I0].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_IC1I0].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_IC1I0].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW0_IC1I0,                    /* Input capture 1 IEN mask bit */
};
/* Channel control info */
static cmtw_prv_ch_ctrl_info_t g_cmtw_ctrl_ch0 =
{
    &g_cmtw_rom_ch0,                    /* Pointer to ROM info */
    NULL,                               /* Pointer to callback */
    CMTW_PRV_CHANNEL_STATE_CLOSED,      /* Channel state */
    CMTW_ACTION_NONE,                   /* Compare match action */
    CMTW_ACTION_NONE,                   /* Output compare 0 action */
    CMTW_ACTION_NONE,                   /* Output compare 1 action */
    CMTW_ACTION_NONE,                   /* Input capture 0 action */
    CMTW_ACTION_NONE,                   /* Input capture 1 action */
};
#endif

#if CMTW_CFG_USE_CH1 == 1
/* Channel ROM info */
const cmtw_prv_ch_rom_info_t g_cmtw_rom_ch1 =
{
    &(CMTW1),                           /* Pointer to the registers */
    CMTW_CHANNEL_1,                     /* Channel */
    BIT0_MASK,                          /* MSTP mask bit */
    CWTW_CFG_IPR_CM_CH1,                /* Compare match interrupt priority level */
    CMTW_CFG_IPR_OC0_CH1,               /* Output Compare 0 interrupt priority level */
    CMTW_CFG_IPR_OC1_CH1,               /* Output Compare 1 interrupt priority level */
    CMTW_CFG_IPR_IC0_CH1,               /* Input capture 0 interrupt priority level */
    CMTW_CFG_IPR_1C1_CH1,               /* Input capture 1 interrupt priority level */
    &ICU.IR[IR_CMTW1_CMWI1].BYTE,       /* Pointer to compare match ICU IR register */
    &ICU.IPR[IPR_CMTW1_CMWI1].BYTE,     /* Pointer to compare match ICU IPR register */
    &ICU.IER[IER_CMTW1_CMWI1].BYTE,     /* Pointer to compare match ICU IER register */
    IEN_CMTW1_CMWI1,                    /* Compare match IEN mask bit */
    &ICU.IR[IR_CMTW1_OC0I1].BYTE,       /* Pointer to output compare 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_OC0I1].BYTE,     /* Pointer to output compare 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_OC0I1].BYTE,     /* Pointer to output compare 0 ICU IER register */
    IEN_CMTW1_OC0I1,                    /* Output compare 0 IEN mask bit */
    &ICU.IR[IR_CMTW1_OC1I1].BYTE,       /* Pointer to output compare 1 ICU IR register */
    &ICU.IPR[IPR_CMTW1_OC1I1].BYTE,     /* Pointer to output compare 1 ICU IPR register */
    &ICU.IER[IER_CMTW1_OC1I1].BYTE,     /* Pointer to output compare 1 ICU IER register */
    IEN_CMTW1_OC1I1,                    /* Output compare 1 IEN mask bit */
    &ICU.IR[IR_CMTW1_IC0I1].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_IC0I1].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_IC0I1].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW1_IC0I1,                    /* Input capture 0 IEN mask bit */
    &ICU.IR[IR_CMTW1_IC1I1].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_IC1I1].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_IC1I1].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW1_IC1I1,                    /* Input capture 1 IEN mask bit */
};
/* Channel control info */
static cmtw_prv_ch_ctrl_info_t g_cmtw_ctrl_ch1 =
{
    &g_cmtw_rom_ch1,                    /* Pointer to ROM info */
    NULL,                               /* Pointer to callback */
    CMTW_PRV_CHANNEL_STATE_CLOSED,      /* Channel state */
    CMTW_ACTION_NONE,                   /* Compare match action */
    CMTW_ACTION_NONE,                   /* Output compare 0 action */
    CMTW_ACTION_NONE,                   /* Output compare 1 action */
    CMTW_ACTION_NONE,                   /* Input capture 0 action */
    CMTW_ACTION_NONE,                   /* Input capture 1 action */
};
#endif

cmtw_prv_ch_ctrl_info_t * const g_cmtw_handles[] =
{
    #if CMTW_CFG_USE_CH0 == 1
    &g_cmtw_ctrl_ch0,
    #else
    NULL,
    #endif
    #if CMTW_CFG_USE_CH1 == 1
    &g_cmtw_ctrl_ch1,
    #else
    NULL,
    #endif
};

static const uint32_t g_cmtw_clock_divisors[] = {8, 32, 128, 512};
static const float g_cmtw_time_units[] = {1e-9, 1e-6, 1e-3, 1};

static void power_on(cmtw_prv_ch_ctrl_info_t  * const hdl);
static void power_off(cmtw_prv_ch_ctrl_info_t  * const hdl);
static uint32_t calculate_count(cmtw_time_unit_t time_unit, cmtw_clock_divisor_t clock_divisor, uint32_t time);
static void cmtw_isr_common(cmtw_event_t event, uint32_t count, cmtw_prv_ch_ctrl_info_t * const hdl);
/***********************************************************************************************************************
* Function Name: R_CMTW_Open
* Description  : Applies power to the CMTW channel, initializes the registers,
*                and sets the user configurable options
* Arguments    : channel -
*                   Number of the CMTW channel to be initialized
*                pconfig -
*                   Pointer to the CMTW channel settings data structure
*                pcallback -
*                   Pointer to the user function to call
* Return Value : CMTW_SUCCESS -
*                   Successful, channel is opened
*                CMTW_ERR_BAD_CHAN -
*                   Invalid channel number
*                CMTW_ERR_CH_NOT_CLOSED -
*                   Channel currently in operation, perform R_CMTW_Close() first
*                CMTW_ERR_INVALID_ARG -
*                   An element of the pconfig structure contains an invalid value
*                CMTW_ERR_OUT_OF_RANGE -
*                   Calculated count value is not in range
*                CMTW_ERR_NULL_PTR -
*                   Either pconfig or pcallback is null
*                CMTW_ERR_LOCK -
*                   The lock could not be acquired, the channel is busy
***********************************************************************************************************************/
cmtw_err_t    R_CMTW_Open(cmtw_channel_t          channel,
                          cmtw_channel_settings_t *pconfig,
                          void                    (* const pcallback)(void *pdata))
{
    cmtw_prv_ch_ctrl_info_t *hdl;
    uint32_t                count;


#if CMTW_CGF_REQUIRE_LOCK == 1
    bool lock_result;
#endif

#if CMTW_CFG_PARAM_CHECKING_ENABLE == 1
    /* Parameter check - channel */
    if (CMTW_CHANNEL_MAX <= channel)
    {
        return(CMTW_ERR_BAD_CHAN);
    }

