pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
    /* Parameter check - pconfig */
    if ((NULL == (void *)pconfig) || (FIT_NO_FUNC == (void *)pconfig))
    {
        return(CMTW_ERR_NULL_PTR);
    }

    /* Parameter check - time unit, clock divisor, clear source */
    if ((CMTW_TIME_MAX <= pconfig->time_unit) ||
        (CMTW_CLK_DIV_MAX <= pconfig->clock_divisor) ||
        (CMTW_CLR_MAX <= pconfig->clear_source) || (2 == pconfig->clear_source) || (3 == pconfig->clear_source))
    {
        return(CMTW_ERR_INVALID_ARG);
    }

    /* Parameter check - compare match */
    if (CMTW_ACTION_NONE != pconfig->cm_timer.actions)
    {
        /* Check callback pointer */
        if (CMTW_ACTION_CALLBACK & pconfig->cm_timer.actions)
        {
            if ((NULL == pcallback) || (FIT_NO_FUNC == pcallback))
            {
                return(CMTW_ERR_NULL_PTR);
            }
        }
    }

    /* Parameter check - output compare 0 */
    if (CMTW_ACTION_NONE != pconfig->oc_timer_0.actions)
    {
        /* Check callback pointer */
        if (CMTW_ACTION_CALLBACK & pconfig->oc_timer_0.actions)
        {
            if ((NULL == pcallback) || (FIT_NO_FUNC == pcallback))
            {
                return(CMTW_ERR_NULL_PTR);
            }
        }
        /* Check parameters */
        if (CMTW_OUTPUT_MAX <= pconfig->oc_timer_0.output)
        {
            return(CMTW_ERR_INVALID_ARG);
        }
    }

    /* Parameter check - output compare 1 */
    if (CMTW_ACTION_NONE != pconfig->oc_timer_1.actions)
    {
        /* Check callback pointer */
        if (CMTW_ACTION_CALLBACK & pconfig->oc_timer_1.actions)
        {
            if ((NULL == pcallback) || (FIT_NO_FUNC == pcallback))
            {
                return (CMTW_ERR_NULL_PTR);
            }
        }
        /* Check parameters */
        if (CMTW_OUTPUT_MAX <= pconfig->oc_timer_1.output)
        {
            return(CMTW_ERR_INVALID_ARG);
        }

    }

    /* Parameter check - input capture 0 */
    if (CMTW_ACTION_NONE != pconfig->ic_timer_0.actions)
    {
        /* Check callback pointer */
        if (CMTW_ACTION_CALLBACK & pconfig->ic_timer_0.actions)
        {
            if ((NULL == pcallback) || (FIT_NO_FUNC == pcallback))
             {
                 return (CMTW_ERR_NULL_PTR);
             }
        }
        /* Check parameters */
        if (CMTW_EDGE_MAX <= pconfig->ic_timer_0.edge)
        {
            return(CMTW_ERR_INVALID_ARG);
        }
    }

    /* Parameter check - input capture 1 */
    if (CMTW_ACTION_NONE != pconfig->ic_timer_1.actions)
    {
        /* Check callback pointer */
        if (CMTW_ACTION_CALLBACK & pconfig->ic_timer_1.actions)
        {
            if ((NULL == pcallback) || (FIT_NO_FUNC == pcallback))
             {
                 return (CMTW_ERR_NULL_PTR);
             }
        }
        /* Check parameters */
        if (CMTW_EDGE_MAX <= pconfig->ic_timer_1.edge)
        {
            return(CMTW_ERR_INVALID_ARG);
        }
    }
#endif

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Get lock for this channel */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));

    if (false == lock_result)
    {
        return(CMTW_ERR_LOCK);
    }
#endif

    /* Get the handle for the channel - pointer to the channel control info */
    hdl = g_cmtw_handles[channel];

    /* Check if channel enabled */
    if (NULL == hdl)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return (CMTW_ERR_CH_NOT_ENABLED);
    }

    /* Check channel state */
    if (CMTW_PRV_CHANNEL_STATE_CLOSED != hdl->state)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return (CMTW_ERR_CH_NOT_CLOSED);
    }

    /* Turn power on to the channel */
    power_on(hdl);

    /* Set clock divisor, counter clear-source, 32-bit operation */
    hdl->rom->regs->CMWCR.BIT.CKS = pconfig->clock_divisor;
    hdl->rom->regs->CMWCR.BIT.CCLR = pconfig->clear_source;
    hdl->rom->regs->CMWCR.BIT.CMS = 0;

    /* Save the callback */
    hdl->pcallback = pcallback;


    /* COMPARE MATCH */
    if (CMTW_ACTION_NONE != pconfig->cm_timer.actions)
    {
        /* Calculate timer count */
        count = calculate_count(pconfig->time_unit,
                                pconfig->clock_divisor,
                                pconfig->cm_timer.time);

        /* Set timer counter if in range, otherwise return */
        if (0 == count)
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            R_CMTW_Close(channel);
            return(CMTW_ERR_OUT_OF_RANGE);
        }

        /* Set the compare match count */
        hdl->rom->regs->CMWCOR = count;

        /* Enable compare match */
        hdl->rom->regs->CMWIOR.BIT.CMWE = 1;

        if (CMTW_ACTION_ISR_ENABLE_MASK & pconfig->cm_timer.actions)
        {
            /* Save action for ISR processing */
            hdl->cm_action = pconfig->cm_timer.actions;

            /* Clear ICU interrupt request, set level, and enable it */
            *hdl->rom->ir_cm = 0;
            *hdl->rom->ipr_cm = hdl->rom->cm_priorty;
            *hdl->rom->ier_cm |= hdl->rom->cm_enable_mask;

            /* Enable compare match interrupt */
            hdl->rom->regs->CMWCR.BIT.CMWIE = 1;
        }

        /* Change state to open */
        hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
    }

    /* OUTPUT COMPARE 0 */
    if (CMTW_ACTION_NONE != pconfig->oc_timer_0.actions)
    {
        /* Calculate timer count */
        count = calculate_count(pconfig->time_unit,
                                pconfig->clock_divisor,
                                pconfig->oc_timer_0.time);

        /* Set timer counter if in range, otherwise return */
        if (0 == count)
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            R_CMTW_Close(channel);
            return(CMTW_ERR_OUT_OF_RANGE);
        }

