pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
        /* Set the output compare count */
        hdl->rom->regs->CMWOCR0 = count;

        /* Enable output compare */
        hdl->rom->regs->CMWIOR.BIT.OC0E = 1;

        /* Set output compare pin state */
        hdl->rom->regs->CMWIOR.BIT.OC0 = pconfig->oc_timer_0.output;

        if (CMTW_ACTION_ISR_ENABLE_MASK & pconfig->oc_timer_0.actions)
        {
            /* Save action for ISR processing */
            hdl->oc0_action = pconfig->oc_timer_0.actions;

            /* Clear ICU interrupt request, set level, and enable it */
            *hdl->rom->ir_oc0 = 0;
            *hdl->rom->ipr_oc0 = hdl->rom->oc0_priorty;
            *hdl->rom->ier_oc0 |= hdl->rom->oc0_enable_mask;

            /* Enable output compare 0 interrupt */
            hdl->rom->regs->CMWCR.BIT.OC0IE = 1;
        }

        /* Change state to open */
        hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
    }

    /* OUTPUT COMPARE 1 */
    if (CMTW_ACTION_NONE != pconfig->oc_timer_1.actions)
    {
        /* Calculate timer count */
        count = calculate_count(pconfig->time_unit,
                                pconfig->clock_divisor,
                                pconfig->oc_timer_1.time);

        /* Set timer counter if in range, otherwise return */
        if (0 == count)
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            R_CMTW_Close(channel);
            return(CMTW_ERR_OUT_OF_RANGE);
        }

        /* Set the output compare count */
        hdl->rom->regs->CMWOCR1 = count;

        /* Enable output compare */
        hdl->rom->regs->CMWIOR.BIT.OC1E = 1;

        /* Set output compare pin state */
        hdl->rom->regs->CMWIOR.BIT.OC1 = pconfig->oc_timer_1.output;

        if (CMTW_ACTION_ISR_ENABLE_MASK & pconfig->oc_timer_1.actions)
        {
            /* Save action for ISR processing */
            hdl->oc1_action = pconfig->oc_timer_1.actions;

            /* Clear ICU interrupt request, set level, and enable it */
            *hdl->rom->ir_oc1 = 0;
            *hdl->rom->ipr_oc1 = hdl->rom->oc1_priorty;
            *hdl->rom->ier_oc1 |= hdl->rom->oc1_enable_mask;

            /* Enable output compare 0 interrupt */
            hdl->rom->regs->CMWCR.BIT.OC1IE = 1;
        }

        /* Change state to open */
        hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
    }

    /* INPUT CAPTURE 0 */
    if (CMTW_ACTION_NONE != pconfig->ic_timer_0.actions)
    {
        /* Enable input capture */
        hdl->rom->regs->CMWIOR.BIT.IC0E = 1;

        /* Set pin edge to capture */
        hdl->rom->regs->CMWIOR.BIT.IC0 = pconfig->ic_timer_0.edge;

        if (CMTW_ACTION_ISR_ENABLE_MASK & pconfig->ic_timer_0.actions)
        {
            /* Save action for ISR processing */
            hdl->ic0_action = pconfig->ic_timer_0.actions;

            /* Clear ICU interrupt request, set level, and enable it */
            *hdl->rom->ir_ic0 = 0;
            *hdl->rom->ipr_ic0 = hdl->rom->ic0_priorty;
            *hdl->rom->ier_ic0 |= hdl->rom->ic0_enable_mask;

            /* Enable input capture 0 interrupt */
            hdl->rom->regs->CMWCR.BIT.IC0IE = 1;
        }

        /* Change state to open */
        hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
    }

    /* INPUT CAPTURE 1 */
    if (CMTW_ACTION_NONE != pconfig->ic_timer_1.actions)
    {
        /* Enable input capture */
        hdl->rom->regs->CMWIOR.BIT.IC1E = 1;

        /* Set pin edge to capture */
        hdl->rom->regs->CMWIOR.BIT.IC1 = pconfig->ic_timer_1.edge;

        if (CMTW_ACTION_ISR_ENABLE_MASK & pconfig->ic_timer_1.actions)
        {
            /* Save action for ISR processing */
            hdl->ic1_action = pconfig->ic_timer_1.actions;

            /* Clear ICU interrupt request, set level, and enable it */
            *hdl->rom->ir_ic1 = 0;
            *hdl->rom->ipr_ic1 = hdl->rom->ic1_priorty;
            *hdl->rom->ier_ic1 |= hdl->rom->ic1_enable_mask;

            /* Enable input capture 1 interrupt */
            hdl->rom->regs->CMWCR.BIT.IC1IE = 1;
        }

        /* Change state to open */
        hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
    }

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Release lock for this channel */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif

    return(CMTW_SUCCESS);
}

/***********************************************************************************************************************
* Function Name: R_CMTW_Close
* Description  : Disables the CMTW timers for the channel and removes power
* Arguments    : channel -
*                   Number of the CMTW channel
* Return Value : CMTW_SUCCESS -
*                   Successful, channel is closed
*                CMTW_ERR_BAD_CHAN -
*                   Invalid channel number
*                CMTW_ERR_CH_NOT_OPENED -
*                   Channel currently closed, perform R_CMTW_Open() first
*                CMTW_ERR_LOCK -
*                   The lock could not be acquired, the channel is busy
***********************************************************************************************************************/
cmtw_err_t    R_CMTW_Close(cmtw_channel_t    channel)
{
    cmtw_prv_ch_ctrl_info_t *hdl;

#if CMTW_CGF_REQUIRE_LOCK == 1
    bool lock_result;
#endif

#if CMTW_CFG_PARAM_CHECKING_ENABLE == 1
/* Parameter check - channel */
    if (CMTW_CHANNEL_MAX <= channel)
    {
        return (CMTW_ERR_BAD_CHAN);
    }
#endif

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Get lock for this channel */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));

    if (false == lock_result)
    {
        return(CMTW_ERR_LOCK);
    }
#endif

    /* Get the handle for the channel - pointer to the channel control info */
    hdl = g_cmtw_handles[channel];

    /* Check if channel enabled */
    if (NULL == hdl)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return (CMTW_ERR_CH_NOT_ENABLED);
    }

    /* Check channel state */
    if (CMTW_PRV_CHANNEL_STATE_CLOSED == hdl->state)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return (CMTW_ERR_CH_NOT_OPENED);
    }

    /* Clear all registers */
    hdl->rom->regs->CMWSTR.WORD = 0;
    hdl->rom->regs->CMWCR.WORD = 0;
    hdl->rom->regs->CMWIOR.WORD = 0;
    hdl->rom->regs->CMWCNT = 0;
    hdl->rom->regs->CMWCOR = 0;
    hdl->rom->regs->CMWICR0 = 0;
    hdl->rom->regs->CMWICR1 = 0;
    hdl->rom->regs->CMWOCR0 = 0;
    hdl->rom->regs->CMWOCR1 = 0;

    /* Clear ICU interrupts */
    *hdl->rom->ir_cm = 0;
    *hdl->rom->ipr_cm = 0;
    *hdl->rom->ier_cm &= ~hdl->rom->cm_enable_mask;

