pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
    *hdl->rom->ir_oc0 = 0;
    *hdl->rom->ipr_oc0 = 0;
    *hdl->rom->ier_oc0 &= ~hdl->rom->oc0_enable_mask;

    *hdl->rom->ir_oc1 = 0;
    *hdl->rom->ipr_oc1 = 0;
    *hdl->rom->ier_oc1 &= ~hdl->rom->oc1_enable_mask;

    *hdl->rom->ir_ic0 = 0;
    *hdl->rom->ipr_ic0 = 0;
    *hdl->rom->ier_ic0 &= ~hdl->rom->ic0_enable_mask;

    *hdl->rom->ir_ic1 = 0;
    *hdl->rom->ipr_ic1 = 0;
    *hdl->rom->ier_ic1 &= ~hdl->rom->ic1_enable_mask;

    /* Change state to closed */
    hdl->state = CMTW_PRV_CHANNEL_STATE_CLOSED;

    /* Turn power off to the channel */
    power_off(hdl);

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Release lock for this channel */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif


    return(CMTW_SUCCESS);
}

/***********************************************************************************************************************
* Function Name: R_CMTW_Control
* Description  : Executes commands for the channel
* Arguments    : channel -
*                   Number of the CMTW channel
* Return Value : CMTW_SUCCESS -
*                   Successful, channel is controlled
*                CMTW_ERR_BAD_CHAN -
*                   Invalid channel number
*                CMTW_ERR_CH_NOT_OPENED -
*                   Channel currently closed, perform R_CMTW_Open() first
*                CMTW_ERR_CH_NOT_RUNNIG -
*                   Channel currently not started - perform R_CMTW_Control() to start
*                CMTW_ERR_CH_NOT_STOPPED -
*                   Channel currently running - perform R_CMTW_Control() to stop
*                CMTW_ERR_UNKNOWN_CMD -
*                   Invalid command
*                CMTW_ERR_LOCK -
*                   The lock could not be acquired, the channel is busy
***********************************************************************************************************************/
cmtw_err_t    R_CMTW_Control(cmtw_channel_t     channel,
                             cmtw_cmd_t         cmd)
{
    cmtw_prv_ch_ctrl_info_t *hdl;

#if CMTW_CGF_REQUIRE_LOCK == 1
    bool lock_result;
#endif

#if CMTW_CFG_PARAM_CHECKING_ENABLE == 1
    /* Parameter check - channel */
    if (CMTW_CHANNEL_MAX <= channel)
    {
        return(CMTW_ERR_BAD_CHAN);
    }

    /* Parameter check - cmd */
    if (CMTW_CMD_MAX <= cmd)
    {
        return(CMTW_ERR_UNKNOWN_CMD);
    }
#endif

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Get lock for this channel */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));

    if (false == lock_result)
    {
        return(CMTW_ERR_LOCK);
    }
#endif

    /* Get the handle for the channel - pointer to the channel control info */
    hdl = g_cmtw_handles[channel];

    /* Check if channel enabled */
    if (NULL == hdl)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return (CMTW_ERR_CH_NOT_ENABLED);
    }

    /* Check channel state */
    if (CMTW_PRV_CHANNEL_STATE_CLOSED == hdl->state)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
        return(CMTW_ERR_CH_NOT_OPENED);
    }
    else if (CMTW_PRV_CHANNEL_STATE_OPENED == hdl->state)
    {
        if (CMTW_CMD_STOP == cmd)
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            return (CMTW_ERR_CH_NOT_RUNNIG);
        }
    }
    else if (CMTW_PRV_CHANNEL_STATE_RUNNING == hdl->state)
    {
        if ((CMTW_CMD_START == cmd) || (CMTW_CMD_RESUME == cmd))
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            return (CMTW_ERR_CH_NOT_STOPPED);
        }
    }


    /* Process the command */
    switch (cmd)
    {
        /* Both start and resume do the same thing - start the timers of the this channel */
        case CMTW_CMD_START:
        case CMTW_CMD_RESUME:
            hdl->rom->regs->CMWSTR.BIT.STR = 1;
            hdl->state = CMTW_PRV_CHANNEL_STATE_RUNNING;
        break;

        /* Stop the timers of the this channel */
        case CMTW_CMD_STOP:
            hdl->rom->regs->CMWSTR.BIT.STR = 0;
            hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
        break;

        /* Clears the counter and starts the timers of this channel */
        case CMTW_CMD_RESTART:
            hdl->rom->regs->CMWSTR.BIT.STR = 0;
            hdl->rom->regs->CMWCNT = 0;
            hdl->rom->regs->CMWSTR.BIT.STR = 1;
            hdl->state = CMTW_PRV_CHANNEL_STATE_RUNNING;
        break;

        default:
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif
            return(CMTW_ERR_UNKNOWN_CMD);
        break;
    }

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Release lock for this channel */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + channel));
#endif

    return(CMTW_SUCCESS);
}


/***********************************************************************************************************************
* Function Name: R_CMTW_GetVersion
* Description  : Returns the current version of this module. The version number is encoded where the top 2 bytes are the
*                major version number and the bottom 2 bytes are the minor version number. For example, Version 4.25 
*                would be returned as 0x00040019.
* Arguments    : none
* Return Value : Version of this module.
***********************************************************************************************************************/
#pragma inline(R_CMTW_GetVersion)
uint32_t R_CMTW_GetVersion (void)
{
    /* These version macros are defined in r_cmtw_rx_if.h. */
    return((((uint32_t)CMTW_RX_VERSION_MAJOR) << 16) | (uint32_t)CMTW_RX_VERSION_MINOR);
} 




