pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
/***********************************************************************************************************************
* Function Name: power_on
* Description  : Provides power to the channel specified by the handle.
* Arguments    : hdl -
*                   handle for the channel
* Return Value : none
***********************************************************************************************************************/
static void power_on(cmtw_prv_ch_ctrl_info_t  * const hdl)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.MSTPCRA.LONG &= ~hdl->rom->stop_mask;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}

/***********************************************************************************************************************
* Function Name: power_off
* Description  : Removes power from the channel specified by the handle.
* Arguments    : hdl -
*                   handle for the channel
* Return Value : none
***********************************************************************************************************************/
static void power_off(cmtw_prv_ch_ctrl_info_t  * const hdl)
{
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.MSTPCRA.LONG |= hdl->rom->stop_mask;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}

/***********************************************************************************************************************
* Function Name: calculate_count
* Description  : Calculates the timer count.
* Arguments    : time_unit -
*                   time base
*                clock_divisor -
*                   time clock divisor
*                time -
*                   request time value
* Return Value : count
*                   timer tick count if in range, 0 otherwise
***********************************************************************************************************************/
static uint32_t calculate_count(cmtw_time_unit_t time_unit, cmtw_clock_divisor_t clock_divisor, uint32_t time)
{
    uint32_t divisor;
    uint32_t count;
    float countf;
    float unit;

    unit = g_cmtw_time_units[time_unit];
    divisor = g_cmtw_clock_divisors[clock_divisor];
    countf = (BSP_PCLKB_HZ / divisor * time * unit) - 1;

    /* Check if count is in range */
    if ((countf < CMTW_COUNTF_MIN) || (countf > CMTW_COUNTF_MAX))
    {
        count = 0;
    }
    else
    {
        /* Round up the count if necessary */
        if ((uint32_t)(countf*2) == (uint32_t)(countf)*2)
        {
            count = (uint32_t)countf;
        }
        else
        {
            count = (uint32_t)(countf) + 1;
        }
    }

    return(count);
}

#if CMTW_CFG_USE_CH0 == 1
/***********************************************************************************************************************
* Function Name: cmtw_cm_ch0_isr
* Description  : Compare match interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmtw_cm_ch0_isr(vect=VECT(CMTW0, CMWI0))
static void cmtw_cm_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->cm_action)
    {
        count = hdl->rom->regs->CMWCOR;
        cmtw_isr_common(CMTW_EVENT_CM, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->cm_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.CMWIE = 0;
        hdl->rom->regs->CMWIOR.BIT.CMWE = 0;
    }
}

/***********************************************************************************************************************
* Function Name: cmtw_oc0_ch0_isr
* Description  : Output compare 0 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmtw_oc0_ch0_isr(vect=VECT_CMTW0_OC0I0)
static void cmtw_oc0_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->oc0_action)
    {
        count = hdl->rom->regs->CMWOCR0;
        cmtw_isr_common(CMTW_EVENT_OC0, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->oc0_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWIOR.BIT.OC0 = 0;
        hdl->rom->regs->CMWCR.BIT.OC0IE = 0;
        hdl->rom->regs->CMWIOR.BIT.OC0E = 0;
    }
}

/***********************************************************************************************************************
* Function Name: cmtw_oc1_ch0_isr
* Description  : Output compare 1 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmtw_oc1_ch0_isr(vect=VECT_CMTW0_OC1I0)
static void cmtw_oc1_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->oc1_action)
    {
        count = hdl->rom->regs->CMWOCR1;
        cmtw_isr_common(CMTW_EVENT_OC1, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->oc1_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWIOR.BIT.OC1 = 0;
        hdl->rom->regs->CMWCR.BIT.OC1IE = 0;
        hdl->rom->regs->CMWIOR.BIT.OC1E = 0;
    }
}

