pwbf/RX64M_THULake/r_cmtw_rx/src/r_cmtw_rx.c
    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_1];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->ic0_action)
    {
        count = hdl->rom->regs->CMWICR0;
        cmtw_isr_common(CMTW_EVENT_IC0, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->ic0_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.IC0IE = 0;
        hdl->rom->regs->CMWIOR.BIT.IC0E = 0;
    }
}

/***********************************************************************************************************************
* Function Name: cmtw_ic1_ch1_isr
* Description  : Input capture 1 interrupt handler for channel 1.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmtw_ic1_ch1_isr(vect=VECT_CMTW1_IC1I1)
static void cmtw_ic1_ch1_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_1];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->ic1_action)
    {
        count = hdl->rom->regs->CMWICR1;
        cmtw_isr_common(CMTW_EVENT_IC1, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->ic1_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.IC1IE = 0;
        hdl->rom->regs->CMWIOR.BIT.IC1E = 0;
    }
}
#endif

/***********************************************************************************************************************
* Function Name: cmtw_isr_common
* Description  : Common ISR code for handling all CMTW interrupts.
* Arguments    : event -
*                   interrupt source
*                count -
*                   timer count for the event
*                hdl -
*                   pointer to the channel control block
* Return Value : none
***********************************************************************************************************************/
static void cmtw_isr_common(cmtw_event_t event, uint32_t count, cmtw_prv_ch_ctrl_info_t * const hdl)
{
    cmtw_callback_data_t    cb_data;

    /* Call the callback if available */
    if ((NULL != hdl->pcallback) && (FIT_NO_FUNC != hdl->pcallback))
    {
        cb_data.channel = hdl->rom->channel;
        cb_data.event = event;
        cb_data.count = count;

        hdl->pcallback((void *)&cb_data);
    }
}
